#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <windows.h>
int main()
{
    
    system("color 0a");
    
    
   char a[50][50]={"###########################",
                   "###O#####  ######    ######",
                   "###               #########",
                   "########## ####       #####",
                   "###########      ##  ######",
                   "### ################ #### #",
                   "####                 ######",
                   "#### ######################",
                  };
                  
   int i,j,x,y,t;
   t=1;
   
   x=1;y=3;i=8;j=4;
 
 
   
   for(t=0;t<=7;t++)
   {
       puts(a[t]);
   }
   
   char ch;
   
 while(1)
{
  
      ch=getch();
   
   
    //--------------------
       if(ch=='s')   //1
   {
       if(a[x+1][y]!='#')
       {
           a[x][y]=' ';
           x++;
           a[x][y]='o';
       }
       
       system("cls");
       for(t=0;t<=7;t++)
       {
           puts(a[t]);
       }
       
   }
   
       
     //----------------------------------------------------  
       
        if(ch=='w')  //2
   {
       if(a[x-1][y]!='#')
       {
           a[x][y]=' ';
           x--;
           a[x][y]='o';
       }
       
       system("cls");
       for(t=0;t<=7;t++)
       {
           puts(a[t]);
       }            
       
   }  
      //----------------------------------------------------
      
        if(ch=='a')  //3
    {
       if(a[x][y-1]!='#')
       {
           a[x][y]=' ';
           y--;
           a[x][y]='o';
       }
       
       system("cls");
       for(t=0;t<=7;t++)
       {
           puts(a[t]);
       }            
    }
     //-------------------------------------------------------- 
     
       
        if(ch=='d')  //4
   {
       if(a[x][y+1]!='#')
       {
           a[x][y]=' ';
           y++;
           a[x][y]='o';
       }
       
       system("cls");
       for(t=0;t<=7;t++)
       {
           puts(a[t]);
       }            
   }
   
       
   
   
 
 
      if(a[x][y]==a[i][j])
      {
          puts("恭喜您成功通过");
          Sleep(6000);
         
          break;
      }
 
      else
      {
          continue;
      }
  }

   
   
   
    return 0;
}
